eisup_2019_docmng_integration/src/Documents/абс_ВыгрузкаАСБ/абс_ВыгрузкаАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВыгрузкаАСБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыАСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеФакта</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинСтруктура</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>БюджетнаяСтатья</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСетей</name>
      <type>
        <types>CatalogRef.абс_ТипыСетей</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюты</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыАСБ/абс_СтатусыАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыАСБ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Заполнение</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеВыгрузки</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ВыгрузкаАСБ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	абс_Статус 		= Перечисления.абс_СтатусыАСБ.Подготовка;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация	 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	абс_Статус 		= Перечисления.абс_СтатусыАСБ.Подготовка;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	ДанныеФакта.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.абс_ИсторияСтатусовАСБ.ЗаписатьСтатус(Ссылка, абс_Статус, ДополнительныеСвойства);
		
КонецПроцедуры
